      * Required: Info about the program
       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO.
       AUTHOR. LUCID.
      * INPUT / OUTPUT
       ENVIRONMENT      DIVISION.
      * Constants
       DATA DIVISION.
      * Executable Code
       PROCEDURE DIVISION.
           DISPLAY 'Hello World!'.
           STOP RUN.
